app/views/contacts/_form.html.erb

      <%= address_fields.label :state %><br>
      <%= address_fields.select :state,  options_for_states(@contact.address.state)  %>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = ? LIMIT 1  [["contact_id", 13]]