app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:name).page(params[:page]).per(15)
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "contacts"

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "tiago"], ["email", "tiago@teste.com"], ["kind_id", 1], ["rmk", "observacao"], ["created_at", "2018-03-06 23:32:53.805078"], ["updated_at", "2018-03-06 23:32:53.805078"]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "email" = ?, "kind_id" = ?, "rmk" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "tiago1"], ["email", "tiago@teste.com1"], ["kind_id", 3], ["rmk", "observacao1"], ["updated_at", "2018-03-06 23:33:03.434688"], ["id", 1]]

    def set_options_for_select
      @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds" WHERE (value > 0)