app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
    @name  = "Tiago Leal"
    @kinds = Kind.all

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2018-03-01 00:44:20.773017"], ["updated_at", "2018-03-01 00:44:20.773017"]]
---
  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save

SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_kind
      @kind = Kind.find(params[:id])